import pandas as pd

data = {
    "Місяць": [
        "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень",
        "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень"
    ],
    "Кількість користувачів": [3200, 2800, 4500, 9800, 13500, 15400, 16200, 15800, 14000, 11000, 6000, 3700]
}

df = pd.DataFrame(data)

print("Використання велодоріжок за 2016 рік:")
print(df)

max_month = df.loc[df["Кількість користувачів"].idxmax()]

print(f"\nНайпопулярніший місяць: {max_month['Місяць']}")
print(f"Кількість користувачів: {max_month['Кількість користувачів']}")
